## ✅ Apply Succeeded

**Deployment:** `4303dca7-3f8e-431f-bd9d-dd3d41b79918`



<details>
<summary>Show Apply Output</summary>

```
FullRestore Sandbox Container
OpenTofu version: OpenTofu v1.11.2
Workspace: /workspace

Initializing the backend...

Initializing provider plugins...
- Finding digitalocean/digitalocean versions matching "~> 2.78.0"...
- Installing digitalocean/digitalocean v2.78.0...
- Installed digitalocean/digitalocean v2.78.0 (signed, key ID F82037E524B9C0E8)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that OpenTofu can guarantee to make the same selections by default when
you run "tofu init" in the future.

OpenTofu has been successfully initialized!
Success! The configuration is valid.

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # digitalocean_app.svelte_mine_game will be created
  + resource "digitalocean_app" "svelte_mine_game" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + deployment_per_page  = 20
      + id                   = (known after apply)
      + live_domain          = (known after apply)
      + live_url             = (known after apply)
      + project_id           = (known after apply)
      + updated_at           = (known after apply)
      + urn                  = (known after apply)

      + dedicated_ips (known after apply)

      + spec {
          + disable_edge_cache              = false
          + disable_email_obfuscation       = false
          + domains                         = (known after apply)
          + enhanced_threat_control_enabled = false
          + features                        = (known after apply)
          + name                            = "svelte-mine-game"
          + region                          = "nyc"

          + domain (known after apply)

          + ingress (known after apply)

          + service {
              + build_command      = "npm run build"
              + environment_slug   = "node-js"
              + http_port          = 3000
              + instance_count     = 1
              + instance_size_slug = "basic-xxs"
              + internal_ports     = (known after apply)
              + name               = "web"
              + run_command        = "node build"

              + github {
                  + branch         = "main"
                  + deploy_on_push = true
                  + repo           = "douglasswm/svelte-mine-game"
                }

              + routes {
                  + path = "/"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_active_deployment_id = (known after apply)
  + app_created_at           = (known after apply)
  + app_default_ingress      = (known after apply)
  + app_id                   = (known after apply)
  + app_live_url             = (known after apply)
  + app_updated_at           = (known after apply)
╷
│ Warning: Argument is deprecated
│ 
│   with digitalocean_app.svelte_mine_game,
│   on main.tf line 34, in resource "digitalocean_app" "svelte_mine_game":
│   34:       routes {
│ 
│ Service level routes are deprecated in favor of ingresses
╵
digitalocean_app.svelte_mine_game: Creating...
digitalocean_app.svelte_mine_game: Still creating... [10s elapsed]
digitalocean_app.svelte_mine_game: Still creating... [20s elapsed]
digitalocean_app.svelte_mine_game: Still creating... [30s elapsed]
digitalocean_app.svelte_mine_game: Still creating... [40s elapsed]
digitalocean_app.svelte_mine_game: Still creating... [50s elapsed]
digitalocean_app.svelte_mine_game: Still creating... [1m0s elapsed]
digitalocean_app.svelte_mine_game: Still creating... [1m10s elapsed]
digitalocean_app.svelte_mine_game: Still creating... [1m20s elapsed]
digitalocean_app.svelte_mine_game: Still creating... [1m30s elapsed]
digitalocean_app.svelte_mine_game: Still creating... [1m40s elapsed]
digitalocean_app.svelte_mine_game: Creation complete after 1m43s [id=f02e8088-6216-4130-a1f1-9fcc35ddc304]
╷
│ Warning: Argument is deprecated
│ 
│   with digitalocean_app.svelte_mine_game,
│   on main.tf line 34, in resource "digitalocean_app" "svelte_mine_game":
│   34:       routes {
│ 
│ Service level routes are deprecated in favor of ingresses
╵

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

app_active_deployment_id = "0c0b2ca1-37ab-4dfa-a1c8-530e1763048a"
app_created_at = "2026-02-28 11:03:44 +0000 UTC"
app_default_ingress = "https://svelte-mine-game-63a35.ondigitalocean.app"
app_id = "f02e8088-6216-4130-a1f1-9fcc35ddc304"
app_live_url = "https://svelte-mine-game-63a35.ondigitalocean.app"
app_updated_at = "2026-02-28 11:05:23 +0000 UTC"
```

</details>

---
*Applied by [FullRestore](https://fullrestore.dev) Native GitOps*
